[
    {
        "phase": 1,
        "points": 7,
        "texts": [
            "Você inicia sua jornada em uma terra mágica e misteriosa.",
            "O botão diante de você é o primeiro passo para grandes descobertas.",
            "Os ventos sussurram segredos enquanto você avança.",
            "Cada ação revela um pouco mais da magia ao seu redor.",
            "Sua aventura começa agora, e o destino aguarda suas ações.",
            "Prepare-se para desbravar o desconhecido!"
        ]
    },
    {
        "phase": 2,
        "points": 14,
        "texts": [
            "O caminho se abre à sua frente, revelando novos desafios.",
            "Com cada clique, a magia ao seu redor se intensifica.",
            "Você começa a sentir o peso das responsabilidades de um herói.",
            "Lendas falam de heróis corajosos como você.",
            "Cada passo que você dá escreve sua história no reino.",
            "A magia responde à sua coragem e persistência."
        ]
    },
    {
        "phase": 3,
        "points": 10,
        "texts": [
            "À medida que você avança, os mistérios do reino se aprofundam.",
            "Os desafios ficam mais intensos, mas sua determinação brilha.",
            "Você encontra sinais de heróis que trilharam este caminho antes de você.",
            "Cada passo faz sua jornada se tornar mais épica.",
            "A magia começa a reconhecer sua bravura.",
            "Sua presença está começando a ser notada."
        ]
    },
    {
        "phase": 4,
        "points": 3,
        "texts": [
            "Você chega a terras onde poucos heróis chegaram antes de você.",
            "O botão se transforma em um símbolo do seu progresso.",
            "A magia ao seu redor se alinha com seu destino.",
            "Histórias sobre sua bravura começam a se espalhar.",
            "Cada desafio enfrenta ajuda a construir sua lenda.",
            "Você está se aproximando das maiores conquistas."
        ]
    },
    {
        "phase": 5,
        "points": 28,
        "texts": [
            "Os reinos ao redor estão agitados com suas conquistas.",
            "Sua jornada está deixando uma marca indelével na história.",
            "Os espíritos antigos observam sua ascensão com admiração.",
            "Você está começando a dominar os segredos da magia.",
            "Cada passo que você dá faz o reino se curvar diante de sua determinação.",
            "Sua saga está se tornando uma das maiores do universo mágico."
        ]
    },
    {
        "phase": 6,
        "points": 9,
        "texts": [
            "Você está desbravando os mistérios dos antigos reinos.",
            "Sua presença é sentida em cada canto do mundo mágico.",
            "Os desafios se tornam épicos, refletindo sua grandeza.",
            "A magia ao seu redor se intensifica com cada conquista.",
            "O destino parece se moldar de acordo com sua vontade.",
            "Sua lenda está sendo contada em todos os reinos."
        ]
    },
    {
        "phase": 7,
        "points": 18,
        "texts": [
            "Você está transcendendo as limitações da realidade.",
            "Cada nova descoberta enriquece a história que você escreve.",
            "Os reinos aguardam ansiosamente por sua próxima ação.",
            "Sua jornada se torna uma lenda que será lembrada por eras.",
            "O poder que você comanda é quase ilimitado.",
            "Você está se aproximando do ápice de sua aventura."
        ]
    },
    {
        "phase": 8,
        "points": 12,
        "texts": [
            "Você alcançou o status de lenda eterna.",
            "O universo celebra suas conquistas e bravura.",
            "Sua jornada está sendo escrita nas estrelas.",
            "Você molda o destino dos mundos com suas ações.",
            "Cada fase de sua aventura é um épico sem igual.",
            "O reino e além reconhecem o poder da sua lenda."
        ]
    },
    {
        "phase": 9,
        "points": 22,
        "texts": [
            "Sua jornada é contada em todos os reinos e dimensões.",
            "O poder que você possui é incomparável e sublime.",
            "Você se tornou uma lenda imortal, eternamente lembrado.",
            "O universo reverencia o impacto de sua aventura.",
            "Cada ação sua ecoa por eras e galáxias.",
            "Você completou uma saga épica, e sua lenda viverá para sempre."
        ]
    }
]
